# ResetMovedBarTransform Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Rebar..::..ResetMovedBarTransform Method
Rebar Class See Also
---
Reset the transformation representing the movement of the bar relative to its default position along the distribution path. The moved bar transform will be set to Identity.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public void ResetMovedBarTransform(
	int barPositionIndex
)
```

Visual Basic
---
```text
Public Sub ResetMovedBarTransform ( _
	barPositionIndex As Integer _
)
```

Visual C++
---
```text
public:
void ResetMovedBarTransform(
	int barPositionIndex
)
```

# ### Parameters
barPositionIndex
    Type: System..::..Int32 The bar index.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | barPositionIndex is not in the range [ 0, NumberOfBarPositions-1 ]. |

# See Also
Rebar Class
Autodesk.Revit.DB.Structure Namespace